src/main/java/ok/dht/test/scheredin/report/stage_2/wrk_output/wrk_output_multi_thread_FIFO
wrk2 -R 600 -c 32 -t 4 -d 60s -s /Users/artem.scheredin/projects/technop/highload/src/main/java/ok/dht/test/scheredin/report/scripts/get.lua  -L http://localhost:19234 && sleep 20 && wrk2 -R 40500 -c 32 -t 4 -d 60s -s /Users/artem.scheredin/projects/technop/highload/src/main/java/ok/dht/test/scheredin/report/scripts/put.lua  -L http://localhost:19234

Running 1m test @ http://localhost:19234
  4 threads and 32 connections
  Thread calibration: mean lat.: 8.208ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 8.167ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 8.443ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 7.972ms, rate sampling interval: 27ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.58ms    5.79ms  23.63ms   68.06%
    Req/Sec   152.34     46.05   307.00     70.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.71ms
 75.000%   12.41ms
 90.000%   13.85ms
 99.000%   17.12ms
 99.900%   20.58ms
 99.990%   22.85ms
 99.999%   23.65ms
100.000%   23.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.131     0.000000            1         1.00
       0.742     0.100000         3004         1.11
       1.001     0.200000         6004         1.25
       1.225     0.300000         9000         1.43
       1.442     0.400000        11995         1.67
       1.713     0.500000        14993         2.00
       1.919     0.550000        16490         2.22
       2.269     0.600000        17994         2.50
       9.543     0.650000        19489         2.86
      11.791     0.700000        20997         3.33
      12.415     0.750000        22499         4.00
      12.647     0.775000        23238         4.44
      12.879     0.800000        24000         5.00
      13.087     0.825000        24737         5.71
      13.319     0.850000        25505         6.67
      13.551     0.875000        26240         8.00
      13.695     0.887500        26622         8.89
      13.847     0.900000        26995        10.00
      14.023     0.912500        27369        11.43
      14.207     0.925000        27737        13.33
      14.455     0.937500        28120        16.00
      14.599     0.943750        28303        17.78
      14.735     0.950000        28483        20.00
      14.911     0.956250        28675        22.86
      15.119     0.962500        28863        26.67
      15.351     0.968750        29047        32.00
      15.519     0.971875        29140        35.56
      15.663     0.975000        29236        40.00
      15.799     0.978125        29327        45.71
      15.951     0.981250        29422        53.33
      16.199     0.984375        29513        64.00
      16.415     0.985938        29565        71.11
      16.607     0.987500        29611        80.00
      16.879     0.989062        29655        91.43
      17.311     0.990625        29700       106.67
      17.727     0.992188        29747       128.00
      17.983     0.992969        29772       142.22
      18.223     0.993750        29795       160.00
      18.447     0.994531        29819       182.86
      18.735     0.995313        29844       213.33
      19.055     0.996094        29865       256.00
      19.167     0.996484        29876       284.44
      19.375     0.996875        29889       320.00
      19.551     0.997266        29900       365.71
      19.775     0.997656        29912       426.67
      19.951     0.998047        29923       512.00
      20.095     0.998242        29929       568.89
      20.255     0.998437        29935       640.00
      20.367     0.998633        29941       731.43
      20.495     0.998828        29946       853.33
      20.639     0.999023        29952      1024.00
      20.671     0.999121        29955      1137.78
      20.799     0.999219        29958      1280.00
      20.975     0.999316        29961      1462.86
      21.087     0.999414        29964      1706.67
      21.247     0.999512        29967      2048.00
      21.263     0.999561        29968      2275.56
      21.439     0.999609        29970      2560.00
      21.455     0.999658        29971      2925.71
      21.599     0.999707        29973      3413.33
      21.695     0.999756        29974      4096.00
      21.727     0.999780        29976      4551.11
      21.727     0.999805        29976      5120.00
      21.727     0.999829        29976      5851.43
      22.127     0.999854        29977      6826.67
      22.847     0.999878        29978      8192.00
      22.847     0.999890        29978      9102.22
      23.087     0.999902        29979     10240.00
      23.087     0.999915        29979     11702.86
      23.087     0.999927        29979     13653.33
      23.487     0.999939        29980     16384.00
      23.487     0.999945        29980     18204.44
      23.487     0.999951        29980     20480.00
      23.487     0.999957        29980     23405.71
      23.487     0.999963        29980     27306.67
      23.647     0.999969        29981     32768.00
      23.647     1.000000        29981          inf
#[Mean    =        5.578, StdDeviation   =        5.791]
#[Max     =       23.632, Total count    =        29981]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36004 requests in 1.00m, 2.22MB read
Requests/sec:    600.05
Transfer/sec:     37.85KB
Running 1m test @ http://localhost:19234
  4 threads and 32 connections
  Thread calibration: mean lat.: 1.286ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.286ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.284ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.289ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  712.76us  10.47ms   76.16%
    Req/Sec    10.68k     0.91k   19.00k    75.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.63ms
 90.000%    2.03ms
 99.000%    3.49ms
 99.900%    6.99ms
 99.990%    9.06ms
 99.999%   10.02ms
100.000%   10.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.056     0.000000            1         1.00
       0.492     0.100000       203011         1.11
       0.708     0.200000       404919         1.25
       0.882     0.300000       607323         1.43
       1.038     0.400000       809439         1.67
       1.191     0.500000      1012344         2.00
       1.268     0.550000      1113762         2.22
       1.348     0.600000      1214159         2.50
       1.434     0.650000      1316065         2.86
       1.526     0.700000      1417001         3.33
       1.626     0.750000      1517892         4.00
       1.680     0.775000      1568705         4.44
       1.737     0.800000      1619106         5.00
       1.799     0.825000      1669650         5.71
       1.866     0.850000      1719911         6.67
       1.942     0.875000      1770994         8.00
       1.983     0.887500      1795937         8.89
       2.028     0.900000      1821306        10.00
       2.077     0.912500      1846335        11.43
       2.133     0.925000      1871740        13.33
       2.199     0.937500      1897215        16.00
       2.237     0.943750      1909922        17.78
       2.279     0.950000      1922455        20.00
       2.329     0.956250      1935100        22.86
       2.387     0.962500      1947564        26.67
       2.461     0.968750      1960269        32.00
       2.505     0.971875      1966457        35.56
       2.557     0.975000      1972877        40.00
       2.619     0.978125      1979187        45.71
       2.699     0.981250      1985518        53.33
       2.811     0.984375      1991741        64.00
       2.895     0.985938      1994923        71.11
       3.019     0.987500      1998076        80.00
       3.259     0.989062      2001240        91.43
       3.677     0.990625      2004389       106.67
       4.183     0.992188      2007568       128.00
       4.447     0.992969      2009129       142.22
       4.735     0.993750      2010724       160.00
       5.035     0.994531      2012292       182.86
       5.319     0.995313      2013871       213.33
       5.611     0.996094      2015460       256.00
       5.747     0.996484      2016260       284.44
       5.879     0.996875      2017039       320.00
       6.023     0.997266      2017824       365.71
       6.171     0.997656      2018622       426.67
       6.331     0.998047      2019406       512.00
       6.431     0.998242      2019807       568.89
       6.543     0.998437      2020204       640.00
       6.679     0.998633      2020598       731.43
       6.835     0.998828      2020984       853.33
       7.011     0.999023      2021387      1024.00
       7.111     0.999121      2021577      1137.78
       7.243     0.999219      2021776      1280.00
       7.379     0.999316      2021972      1462.86
       7.539     0.999414      2022169      1706.67
       7.719     0.999512      2022368      2048.00
       7.831     0.999561      2022466      2275.56
       7.931     0.999609      2022565      2560.00
       8.047     0.999658      2022664      2925.71
       8.171     0.999707      2022761      3413.33
       8.311     0.999756      2022863      4096.00
       8.391     0.999780      2022912      4551.11
       8.487     0.999805      2022960      5120.00
       8.591     0.999829      2023008      5851.43
       8.735     0.999854      2023058      6826.67
       8.919     0.999878      2023108      8192.00
       8.999     0.999890      2023132      9102.22
       9.063     0.999902      2023156     10240.00
       9.143     0.999915      2023181     11702.86
       9.263     0.999927      2023206     13653.33
       9.343     0.999939      2023231     16384.00
       9.423     0.999945      2023242     18204.44
       9.495     0.999951      2023255     20480.00
       9.551     0.999957      2023267     23405.71
       9.615     0.999963      2023279     27306.67
       9.671     0.999969      2023292     32768.00
       9.695     0.999973      2023300     36408.89
       9.759     0.999976      2023304     40960.00
       9.807     0.999979      2023310     46811.43
       9.879     0.999982      2023319     54613.33
       9.911     0.999985      2023324     65536.00
       9.927     0.999986      2023326     72817.78
       9.967     0.999988      2023329     81920.00
      10.015     0.999989      2023332     93622.86
      10.079     0.999991      2023335    109226.67
      10.111     0.999992      2023338    131072.00
      10.207     0.999993      2023340    145635.56
      10.215     0.999994      2023342    163840.00
      10.239     0.999995      2023343    187245.71
      10.247     0.999995      2023344    218453.33
      10.279     0.999996      2023346    262144.00
      10.303     0.999997      2023347    291271.11
      10.303     0.999997      2023347    327680.00
      10.335     0.999997      2023348    374491.43
      10.399     0.999998      2023349    436906.67
      10.415     0.999998      2023350    524288.00
      10.415     0.999998      2023350    582542.22
      10.415     0.999998      2023350    655360.00
      10.423     0.999999      2023351    748982.86
      10.423     0.999999      2023351    873813.33
      10.471     0.999999      2023352   1048576.00
      10.471     0.999999      2023352   1165084.44
      10.471     0.999999      2023352   1310720.00
      10.471     0.999999      2023352   1497965.71
      10.471     0.999999      2023352   1747626.67
      10.479     1.000000      2023353   2097152.00
      10.479     1.000000      2023353          inf
#[Mean    =        1.264, StdDeviation   =        0.713]
#[Max     =       10.472, Total count    =      2023353]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2429219 requests in 1.00m, 155.22MB read
Requests/sec:  40487.61
Transfer/sec:      2.59MB